{
  "1": [
    "Happy 1st Birthday! Your journey has just begun, and the world is already brighter with you in it. May your life be filled with wonder, love, and endless joy.",
    "One year of you has made the world a better place! Wishing you a lifetime of happiness, health, and discovery on your very first birthday.",
    "To the amazing one-year-old: May your curiosity always lead you to wonderful discoveries and your smile light up every room you enter."
  ],
  "2": [
    "Happy 2nd Birthday! Two years of bringing smiles and joy to everyone around you. May your toddler years be filled with fun adventures and magical moments.",
    "You're growing so fast! At two years old, you're discovering the world with such wonder. May your birthday be as special as you are!",
    "Two times the fun, two times the joy! Happy 2nd birthday to an incredible little person who makes every day brighter."
  ],
  "5": [
    "Happy 5th Birthday! Welcome to the fabulous five! May this year bring you new friendships, exciting adventures, and lots of learning fun.",
    "Five years old and already so amazing! May your birthday be filled with cake, presents, and all your favorite things.",
    "Half a decade of wonderful you! Happy 5th birthday - may your imagination continue to grow as wonderfully as you have."
  ],
  "10": [
    "Double digits! Happy 10th Birthday! This is such an exciting milestone. May your tween years be filled with laughter, growth, and amazing discoveries.",
    "Ten years of being absolutely awesome! May this special birthday mark the beginning of your most incredible year yet.",
    "A decade of you has made the world so much better. Happy 10th birthday - here's to more adventures, learning, and fun!"
  ],
  "13": [
    "Welcome to the teens! Happy 13th Birthday! May this new chapter be filled with self-discovery, growth, and wonderful experiences.",
    "You're officially a teenager! Happy 13th birthday - may these years be some of the most memorable and formative of your life.",
    "Thirteen looks amazing on you! Wishing you a birthday as cool and unique as you are as you enter your teen years."
  ],
  "16": [
    "Sweet Sixteen! Happy Birthday! This is such an exciting milestone. May your 16th year be filled with unforgettable moments and dreams coming true.",
    "Sixteen and absolutely brilliant! Wishing you a year of growth, independence, and wonderful new experiences.",
    "Happy 16th birthday! May this special year bring you closer to your dreams and fill your life with joy and adventure."
  ],
  "18": [
    "Welcome to adulthood! Happy 18th Birthday! May this new chapter bring you wisdom, freedom, and the courage to chase all your dreams.",
    "Eighteen looks incredible on you! Wishing you a birthday filled with hope, promise, and excitement for the future.",
    "Official adult status achieved! Happy 18th birthday - may your journey into adulthood be everything you've dreamed of and more."
  ],
  "21": [
    "The big 2-1! Happy Birthday! May this year of new freedoms bring you wisdom, wonderful experiences, and endless opportunities.",
    "Twenty-one and ready to shine! Wishing you a birthday as fantastic as you are and a year filled with growth and happiness.",
    "Happy 21st birthday! May this milestone year be the beginning of your most amazing adventures yet."
  ],
  "25": [
    "Quarter-century celebration! Happy 25th Birthday! May this year bring you clarity, confidence, and exciting new directions.",
    "Twenty-five and thriving! Wishing you a birthday filled with joy and a year ahead that exceeds all your expectations.",
    "Happy 25th birthday! May this special year be a perfect balance of adventure, growth, and wonderful memories."
  ],
  "30": [
    "Welcome to the fabulous thirties! Happy 30th Birthday! May this new decade bring you wisdom, joy, and the fulfillment of your dreams.",
    "Thirty, flirty, and thriving! Wishing you a birthday as amazing as you are and a decade ahead filled with happiness.",
    "Happy 30th birthday! May this milestone be the beginning of your most confident, successful, and joyful years yet."
  ],
  "40": [
    "Forty and fabulous! Happy Birthday! May this new decade bring you wisdom, contentment, and the joy of knowing yourself completely.",
    "Welcome to your fabulous forties! Wishing you a birthday filled with love and a year ahead that's your best yet.",
    "Happy 40th birthday! May this milestone be celebrated with joy, reflection, and excitement for all that's still to come."
  ],
  "50": [
    "Half a century of amazing! Happy 50th Birthday! May this golden year be filled with joy, reflection, and celebration of all you've accomplished.",
    "Fifty and phenomenal! Wishing you a birthday that's as wonderful as the legacy you've already created.",
    "Happy 50th birthday! May this milestone bring you the wisdom of experience and the joy of dreams still unfolding."
  ],
  "60": [
    "Sixty and sensational! Happy Birthday! May this new chapter be filled with relaxation, joy, and the fruits of your life's work.",
    "Welcome to the splendid sixties! Wishing you a birthday filled with love and a year of wonderful new adventures.",
    "Happy 60th birthday! May this milestone year be a celebration of all you are and all the lives you've touched."
  ],
  "70": [
    "Seventy years of wonderful! Happy Birthday! May this special year be filled with cherished memories, love, and contentment.",
    "Seventy and spectacular! Wishing you a birthday that reflects all the beauty and wisdom you bring to the world.",
    "Happy 70th birthday! May this milestone be a golden celebration of a life well-lived and still shining brightly."
  ],
  "80": [
    "Eighty years of excellence! Happy Birthday! May this milestone be celebrated with all the love and joy you deserve.",
    "Eighty and extraordinary! Wishing you a birthday as remarkable as the legacy you've created.",
    "Happy 80th birthday! May this special year be filled with love, laughter, and beautiful memories."
  ],
  "90": [
    "Ninety years of inspiration! Happy Birthday! May this remarkable milestone be surrounded by love and celebration.",
    "Ninety and truly legendary! Wishing you a birthday that honors the incredible journey you've had.",
    "Happy 90th birthday! May this special day be as wonderful as the life you've lived and the lives you've touched."
  ],
  "100": [
    "A century of wonderful! Happy 100th Birthday! May this historic milestone be celebrated with all the honor and joy you deserve.",
    "One hundred years of making the world better! Wishing you a birthday that's as extraordinary as your journey.",
    "Happy 100th birthday! This incredible milestone is a testament to a life beautifully lived. May your day be filled with love and celebration."
  ],
  "1-4": [
    "Happy Birthday to our little explorer! Every day with you is an adventure. May your special day be filled with fun, laughter, and lots of cake!",
    "To the cutest birthday star! May your day be as bright and wonderful as your smile."
  ],
  "5-12": [
    "Happy Birthday! May your special day be filled with fun, friends, and all your favorite things. Keep being amazing!",
    "To an incredible kid on their birthday: May your year ahead be filled with laughter, learning, and wonderful new adventures!"
  ],
  "13-19": [
    "Happy Birthday! These are the years to dream big and chase what makes you happy. May your special day be the start of an amazing year!",
    "To an awesome teen on their birthday: May this year bring you closer to your dreams and fill your life with memorable moments!"
  ],
  "20-29": [
    "Happy Birthday! Your twenties are for exploration and self-discovery. May this year bring you clarity, adventure, and wonderful growth!",
    "To an amazing twenty-something: May your birthday be as bright as your future and this year be your best one yet!"
  ],
  "30-39": [
    "Happy Birthday! Your thirties are when you truly come into your own. May this year bring you confidence, joy, and fulfillment!",
    "To a fabulous thirty-something: May your birthday be filled with love and your year ahead with wonderful new beginnings!"
  ],
  "40-49": [
    "Happy Birthday! Your forties are a time of wisdom and confidence. May this year bring you peace, joy, and exciting new chapters!",
    "To an incredible forty-something: May your birthday celebrate all you are and all you've accomplished!"
  ],
  "50-59": [
    "Happy Birthday! Your fifties are golden years of wisdom and contentment. May this year bring you joy, health, and beautiful moments!",
    "To a wonderful fifty-something: May your birthday be as special as the legacy you're creating!"
  ],
  "60+": [
    "Happy Birthday! With each year comes more wisdom and grace. May your special day be filled with love, laughter, and cherished memories!",
    "To a remarkable person on their birthday: May your day be a beautiful celebration of a life well-lived and still shining brightly!"
  ],
  "default": [
    "Happy Birthday! Today is your day to shine. May it be filled with joy, love, and wonderful surprises!",
    "Wishing you a birthday as amazing as you are! May your special day be the beginning of a year filled with happiness and success.",
    "Happy Birthday! May this new year of your life bring you closer to your dreams and fill your days with laughter and love.",
    "On your special day, I wish you endless joy, wonderful adventures, and all the happiness you deserve. Happy Birthday!",
    "Another trip around the sun! May your birthday be the start of a year where all your dreams take flight. Happy Birthday!",
    "Happy Birthday! Today we celebrate you and the incredible person you are. May your year ahead be your best one yet!",
    "Wishing you a birthday filled with love, laughter, and wonderful memories. May this new age bring you nothing but joy!",
    "Happy Birthday! May your special day be as bright as your smile and as wonderful as you are to everyone around you.",
    "Cheers to you on your birthday! May this new chapter be filled with health, happiness, and dreams coming true.",
    "Happy Birthday! Today is all about celebrating the amazing person you are. May your year ahead be filled with blessings!"
  ]
}